Ac6Embedded/svd-microchip/PIC32CZ_MC70/PIC32CZ2051MC70100.svd
                     <description>Drive of PIO Line 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE27Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE28</name>
                     <description>Drive of PIO Line 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE28Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE29</name>
                     <description>Drive of PIO Line 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE29Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE30</name>
                     <description>Drive of PIO Line 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE30Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE31</name>
                     <description>Drive of PIO Line 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE31Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCMR</name>
               <description>Parallel Capture Mode Register</description>
               <addressOffset>0x0150</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PCEN</name>
                     <description>Parallel Capture Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSIZE</name>
                     <description>Parallel Capture Mode Data Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DSIZESelect</name>
                        <enumeratedValue>
                           <name>BYTE</name>
                           <description>The reception data in the PIO_PCRHR is a byte (8-bit)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HALFWORD</name>
                           <description>The reception data in the PIO_PCRHR is a half-word (16-bit)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WORD</name>
                           <description>The reception data in the PIO_PCRHR is a word (32-bit)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ALWYS</name>
                     <description>Parallel Capture Mode Always Sampling</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HALFS</name>
                     <description>Parallel Capture Mode Half Sampling</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRSTS</name>
                     <description>Parallel Capture Mode First Sample</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCIER</name>
               <description>Parallel Capture Interrupt Enable Register</description>
               <addressOffset>0x0154</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DRDY</name>
                     <description>Parallel Capture Mode Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Parallel Capture Mode Overrun Error Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Reception Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Reception Buffer Full Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCIDR</name>
               <description>Parallel Capture Interrupt Disable Register</description>
               <addressOffset>0x0158</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DRDY</name>
                     <description>Parallel Capture Mode Data Ready Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Parallel Capture Mode Overrun Error Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Reception Transfer Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Reception Buffer Full Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCIMR</name>
               <description>Parallel Capture Interrupt Mask Register</description>
               <addressOffset>0x015C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DRDY</name>
                     <description>Parallel Capture Mode Data Ready Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Parallel Capture Mode Overrun Error Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Reception Transfer Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Reception Buffer Full Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCISR</name>
               <description>Parallel Capture Interrupt Status Register</description>
               <addressOffset>0x0160</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DRDY</name>
                     <description>Parallel Capture Mode Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Parallel Capture Mode Overrun Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCRHR</name>
               <description>Parallel Capture Reception Holding Register</description>
               <addressOffset>0x0164</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDATA</name>
                     <description>Parallel Capture Mode Reception Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
